{
  "co-op": {
    "generic_rules": [],
    "primary_conditions": [],
    "secondary_conditions": []
  },
  "clash": {
    "generic_rules": [
      "If a player has no Towns or Settlements for 3 rounds, they are eliminated.",
      "If a Main Hero is defeated defending a besieged Town with no remaining towns or settlements, the player is eliminated.",
      "Last player remaining wins.",
      "Collecting a faction cube from each remaining opponent in games with 3+ players also results in a win."
    ],
    "primary_conditions": [
      {
        "condition": "At the end of a round, if any player controls 5 or more \nMines, the players will play one final round. The player \nwith the most Mines at the end of that round is the \nwinner. If every player has the same amount of Mines \nthe game ends in a draw.",
        "secondary_id": 2001,
        "weight": 1
      },
      {
        "condition": "Vanquish the enemy Hero in Combat.",
        "secondary_id": 2002,
        "weight": 1
      },
      {
        "condition": "Be the last remaining player or transport the Grail to your Town.",
        "secondary_id": 2003,
        "weight": 1
      },
      {
        "condition": "Gain the Grail token with a Main Hero and return it to your Faction Town.",
        "secondary_id": 2004,
        "weight": 1
      }
    ],
    "secondary_conditions": [
      {
        "id": 2001,
        "condition": "If no winner by round 8, check control at end of round 9.",
        "weight": 1
      },
      {
        "id": 2002,
        "condition": "If not completed by the end of round 7, players enter a final Combat to decide the winner.",
        "weight": 1
      },
      {
        "id": 2003,
        "condition": "If no winner by round 11 and no eliminations, all players lose.",
        "weight": 1
      },
      {
        "id": 2004,
        "condition": "If not completed by round 10, the player with the Grail gets until round 13.",
        "weight": 1
      }      
    ]
  },
  "alliance": {
    "generic_rules": [
      "Allied players share primary and defeat condition.",
      "An Alliance must meet the scenario-specific primary condition to win.",
      "Alliances can exchange resources and artifacts (with adjacent Heroes)."
    ],
    "primary_conditions": [
      {
        "condition": "Deliver the Grail token to one of the Alliance\\u2019s Towns by the end of round 12.",
        "secondary_id": 1001,
        "weight": 1
      },
      {
        "condition": "Obtain the Grail token and bring it to your Faction Town.",
        "secondary_id": 1002,
        "weight": 1
      },
      {
        "condition": "Control 12 tiles or hold an enemy Town for 2 rounds.",
        "secondary_id": 1003,
        "weight": 1
      }
    ],
    "secondary_conditions": [
      {
        "id": 1001,
        "condition": "If not met, all players lose.",
        "weight": 1        
      },
      {
        "id": 1002,
        "condition": "If not completed by round 11, players get until round 14. Otherwise, all lose.",
        "weight": 1
      },
      {
        "id": 1003,
        "condition": "primary checked at round 11, with possible extension to round 13.",
        "weight": 1
      }
    ]
  },
  "single": {
    "generic_rules": [],
    "primary_conditions": [],
    "secondary_conditions": []
  }
}